04_TurbSim/base_case/system/probes1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval   1;

fields
(
    U
);

probeLocations
(
(1.25 0.15 0.45)
(1.25 0 0.45)
(1.25 -0.15 0.45)
(1.25 0 0.43)
(1.25 0 0.35)
(1.25 0 0.01)
(1.25 0 0.02)
(1.25 0 0.03)
(1.25 0 0.04)
(1.25 0 0.05)
(1.25 0 0.06)
(1.25 0 0.07)
(1.25 0 0.08)
(1.25 0 0.09)
(1.25 0 0.1)
(1.25 0 0.12)
(1.25 0 0.14)
(1.25 0 0.16)
(1.25 0 0.18)
(1.25 0 0.2)
(1.25 0 0.22)
(1.25 0 0.24)
(1.25 0 0.26)
(1.25 0 0.28)
(1.25 0 0.3)
(1.25 0 0.32)
(1.25 0 0.36)
(1.25 0 0.4)
(1.25 0 0.45)
(1.25 0 0.5)
(1.25 0 0.55)
(1.25 0 0.6)
(1.25 0 0.65)
(1.25 0 0.7)
(1.25 0 0.75)
(1.25 0 0.8)
(1.25 0 0.85)
(1.25 0 0.9)
(1.25 0 0.95)
(1.25 0 1)
(1.25 0 1.05)
(1.25 0 1.1)
(1.25 0 1.15)
(1.25 0 1.2)
(1.25 0 1.25)
(1.25 0 1.3)
(1.25 0 1.4)
(1.25 0 1.5)
(1.25 0 1.6)
(1.25 0 1.7)
(1.25 0 1.8)
(1.25 0 1.9)
(1.25 0 2.05)
(1.25 0 2.2)
(1.25 0 2.35)
(1.25 0 2.5)



);

// ************************************************************************* //
